<?php
$mod_list = array(
	'deal',
	'list',
	'mywork',
	'kanban',
	'team',
	'dailyMail'
);

//工单标识数组
$_flag_list = array (
	'1' => '催办',
	'2' => '疑难',
	'3' => '升级',
	'4' => '典型工单'
);
$_state_list = array(
	'1' =>  "待处理",
	'2' =>  "处理中",
	'3' =>  "已解决"
);
$_source_list = array(
	'1' => 'web',
	'2' => 'ivr'
);
$_biz_list = array(
	'1' => 'web',
	'2' => 'ivr'
);
$_approve_list = array(
	'0' => '未填写',
	'1' => '满意',
	'2' => '不满意',
	'3' => '未填写'
);
$_checkup_list = array(
	'0' => '未填写',
	'1' => '优',
	'2' => '良',
	'3' => '差'
);
$_type_list = array(

		'1' => "订单催办",
		'2' => "订单修改",
		'3' => "订单取消",
		'4' =>  "投诉建议",
		'5' =>  "问题咨询",
		'6' =>  "建议表扬",
		//'7' =>  "表扬",
		'8' =>  "预约服务",
		'9' =>  "评论导入"
);
$_subtype_list = array(
        '201' => '修改收货信息',
        '202' => '修改发票抬头',
        '203' => '修改收货时间',
        '401' => '投诉-商品问题',
        '402' => '投诉-订单问题',
        '403' => '投诉-物流问题',
        '404' => '投诉-售后问题',
        '405' => '投诉-活动问题',
        '406' => '投诉客服',
        '407' => '投诉其它',
        '501' => '活动咨询',
        '502' => '其它咨询',
        '601' => '建议',
        '602' => '表扬',
        '901' => '评论导入-满意 ',
		'902' => '评论导入-一般', 
		'903' => '评论导入-不满意'
);

$_fields_map_whole = array('id' => '单据号', 'orderNo' => '订单号', 'archive' => '归档路径','followKF' => '跟进人',
							'flag' => '单据标识','censor' => '质检人','approve' => '满意度','checkup' => '质检结果',
							'isVip' => '是否Vip','finishTime' => '完成时间','source' => '单据来源','acceptTime' => '跟进时间',
	 						'account' => '用户帐号', 'userPhone' => '用户电话',  'createTime' => '创建时间', 
							'type'=> '单据类型', 'state' => '单据状态', 'content' => '问题详情');

$_workflow_list = array(
	'1' => '自动分单',
	'2' => '客服回复',
	'3' => '用户回复',
	'4' => '转单',
	'5' => '备注',
	'6' => '满意度',
	'7' => '归档',
	'8' => '加急',
	'9' => '质检',
	'10'=> '签入',
	'11'=> '签出',
	'12'=> '差评删除'
);
$_MESSAGE_LIST = array(
	'1' => '您有新的工单被转单，请尽快受理',
	'2' => '您有工单被催办，请优先受理',
	'3' => '您有工单预计到达下次跟进时间，请注意',
	'4' => '您的工单超过1小时未响应，请尽快回复安抚用户'
);
$_ORDER_CANCEL_REASON_TYPE = array(
    '1' => "我不想买了",
    '2' => "信息填写错误，重拍",
    '3' => "支付不成功",
    '4' => "找到更便宜的商品",
    '5' => "有商品缺货",
    '6' => "重复下单",
    '7' => "商品无法按时送达",
    '9' => "其它原因"
);

$_QUICK_REPLY_LIST = array(
	'2001' => array('key' => '修改订单-成功', 'txt' => '尊敬的顾客您好，您的订单信息已帮您修改，您可以稍后刷新查看，感谢您对易迅网的支持，欢迎您再次光临，祝您购物愉快！'),
	'2002' => array('key' => '修改订单-无法修改', 'txt' => '尊敬的顾客您好，查看到您的订单是由第三方快递配送并且订单已出库，无法帮您修改信息，请您谅解，感谢您对易迅网的支持，欢迎您再次光临，祝您购物愉快！'),
	'2003' => array('key' => '修改订单-可修改配送延缓', 'txt' => '尊敬的顾客您好，您的订单已为您修改配送地址，修改之后物流会有一定的延缓，请您耐心等待，感谢您对易迅网的支持，欢迎您再次光临，祝您购物愉快！'),
	
	'3001' => array('key' => '首次跟进', 'txt' => '尊敬的顾客您好，给您带来的不便实在抱歉！您反馈的问题已经帮您记录，稍后会及时帮您处理，有进展会直接在线告知您，请您关注在线回复！感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	'3002' => array('key' => '取消订单-无券', 'txt' => '尊敬的顾客您好，您的订单已经帮您取消。感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	'3003' => array('key' => '取消订单-有劵', 'txt' => '尊敬的顾客您好，您的订单已经帮您取消。若订单使用优惠券会一同作废！感谢您对易迅网的支持，欢迎您再次光临，祝您购物愉快！'),
	'3004' => array('key' => '取消订单-已登记退款', 'txt' => '尊敬的顾客您好，您的订单已经帮您取消并登记退款，款项会在3-5个工作日左右原路退还到您的账户，请注意查收。感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	'3005' => array('key' => '取消订单-需拦截物流', 'txt' => '尊敬的顾客您好，查看您的订单现已出库，尽量帮您拦截物流，若拦截不成功，请您务必拒收，感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	
	'6001' => array('key' => '表扬客服', 'txt' => '尊敬的顾客您好，感谢您对易迅网的支持和关注。耐心周到的为顾客服务，是易迅网客服人员的职责所在。日后我们会尽力完善我们的服务体系，提高我们的工作效率和服务质量，为您和广大用户提供令人满意的服务，欢迎您再次光临，祝您购物愉快！'),
	'6002' => array('key' => '表扬快递师傅', 'txt' => '尊敬的客户您好，感谢您对易迅快递人员的表扬，耐心周到的为客户提供送货服务是易迅快递人员职责所在，谢谢您惠顾易迅网！'),
	'4001' => array('key' => '投诉-物流延缓', 'txt' => '尊敬的顾客您好，很抱歉，由于近期订单量较大，物流有部分出现了延缓，给您造成不便，敬请谅解，您的订单我们会为您催促，尽快为您配送到，您请耐心等待，具体到货时间您请以短信通知时间为准,感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	'4002' => array('key' => '投诉-价格保护', 'txt' => '尊敬的顾客您好，请您参考价格保护：http://st.51buy.com/help/priceprotection.htm?YTAG=1.100004023。您下单24小时内，
													系统会对商品价格进行监控，如果降价幅度大于5%且符合价保规则，系统会自动帮您申请价格保护，请您耐心等待。如不符合将无法增加积分。感谢对易迅网的关注与支持。'),
	'4003' => array('key' => '投诉-返调度订单延缓', 'txt' => '尊敬的顾客您好，给您带来的不便十分抱歉！由于分拨异常您的订单需要进行返调度，重新发往正确的分站进行配送，因此订单有所延缓，已经为您登记催促到达站点会尽快安排配送，麻烦您先耐心等待下。感谢您对易迅的支持，欢迎您再次光临，祝您购物愉快！'),
	'4004' => array('key' => '评价-客户的吐槽及建议', 'txt' => '易迅网的发展离不开广大用户的支持，易迅将持之以恒，努力争取为用户提供更优质的服务。希望您以后一如既往的支持和关注！'),
	'4005' => array('key' => '评价-价格吐槽', 'txt' => '尊敬的客户您好，我们为了能让消费者买到最便宜的商品，因此商品价格会随着市场行情会而波动，感谢您对易迅网的支持。'),
	'4006' => array('key' => '评价-商品是否是正品', 'txt' => '尊敬的客户您好，感谢您对易迅网的支持，易迅网所销售的商品均是正品行货，请放心使用，感谢您对易迅网的支持和关注。'),
	'4007' => array('key' => '评价-客户对厂家质检不认可', 'txt' => ' 尊敬的客户您好，易迅产品都享有国家及厂家规定的三包服务保证，给您带来不便，敬请谅解。感谢您对易迅网的支持和关注。')
	
);
$_ARCHIVE_LIST = array(
	'1' => array('name' => '商品咨询', 'py' => 'spzx'),
	'1001' => array('name' => '商品信息', 'py' => 'spxx'),
	'1002' => array('name' => '预售首发商品', 'py' => 'yssfsp'),
	'1003' => array('name' => '商品信息错误', 'py' => 'spxxcw'),
	'1004' => array('name' => '价格举报', 'py' => 'jgjb'),
	'2' => array('name' => '购物流问题', 'py' => 'gwlwt'),
	'2001' => array('name' => '预约安装及商品保养', 'py' => 'yyazjspby'),
	'2002' => array('name' => '团购问题', 'py' => 'tgwt'),
	'2003' => array('name' => '虚拟充值', 'py' => 'xncz'),
	'2004' => array('name' => '支付下单流程咨询', 'py' => 'zfxdlczx'),
	'2005' => array('name' => '邮费问题', 'py' => 'yfwt'),
	'2006' => array('name' => '优惠卷问题', 'py' => 'yhjwt'),
	'2007' => array('name' => '积分使用问题', 'py' => 'jfsywt'),
	'2008' => array('name' => '节能补贴问题', 'py' => 'jnbtwt'),
	'2009' => array('name' => '支付咨询', 'py' => 'zfzx'),
	'2010' => array('name' => '活动咨询', 'py' => 'hdzx'),
	'3' => array('name' => '订单问题', 'py' => 'ddwt'),
	'3001' => array('name' => '订单信息查询', 'py' => 'ddxxcx'),
	'3002' => array('name' => '订单修改', 'py' => 'ddxg'),
	'3003' => array('name' => '贵就赔', 'py' => 'gjp'),
	'3004' => array('name' => '价格保护', 'py' => 'jgbh'),
	'3005' => array('name' => '汇款到账查询', 'py' => 'fkdzcx'),
	'3006' => array('name' => '订单缺货问题', 'py' => 'ddqhwt'),
	'3007' => array('name' => '发票问题', 'py' => 'fpwt'),
	'3008' => array('name' => '商品包装问题', 'py' => 'spbzwt'),
	'3009' => array('name' => '一单多包裹分开到站', 'py' => 'yddbgfkdz'),
	'3010' => array('name' => '多件/少件/空箱', 'py' => 'djsjkx'),
	'3011' => array('name' => '配送进度查询', 'py' => 'psjdcx'),
	'3012' => array('name' => '客户催件', 'py' => 'khcj'),
	'3013' => array('name' => '改日送', 'py' => 'grs'),
	'4' => array('name' => '售后', 'py' => 'sh'),
	'4001' => array('name' => '商品使用问题', 'py' => 'spsywt'),
	'4002' => array('name' => '怀疑假货/二手', 'py' => 'hyjhes'),
	'4003' => array('name' => '上门取件问题', 'py' => 'smqjwt'),
	'4004' => array('name' => '上门换新问题', 'py' => 'smhxwt'),
	'4005' => array('name' => '电话申请售后', 'py' => 'dhsqsh'),
	'4006' => array('name' => '售后进度查询', 'py' => 'shjdcx'),
	'4007' => array('name' => '售后超期催办', 'py' => 'shcqcb'),
	'4008' => array('name' => '不认可售后结果', 'py' => 'brkshjg'),
	'4009' => array('name' => '换货、返修商品问题未解决', 'py' => 'hhfxspwtwjj'),
	'5' => array('name' => '用户评论', 'py' => 'yhpl'),
	'5001' => array('name' => '评论规则', 'py' => 'plgz'),
	'5002' => array('name' => '商品无法评论', 'py' => 'spwfpl'),
	'5003' => array('name' => '评论无法显示', 'py' => 'plwfxs'),
	'5004' => array('name' => '评论无故被删', 'py' => 'plwgbs'),
	'5005' => array('name' => '评论未增加积分', 'py' => 'plwzjjf'),
	'6' => array('name' => '帐号及VIP特权', 'py' => 'zhjviptq'),
	'6001' => array('name' => 'VIP服务特权', 'py' => 'vipfwtq'),
	'6002' => array('name' => '会员特权问题', 'py' => 'hytqwt'),
	'6003' => array('name' => '帐号问题', 'py' => 'zhwt'),
	'6004' => array('name' => '图标显示', 'py' => 'tbxs'),
	'7' => array('name' => '用户投诉及其他', 'py' => 'yhtsjqt'),
	'7001' => array('name' => '投诉平台规则', 'py' => 'tsptgz'),
	'7002' => array('name' => '投诉客服态度', 'py' => 'tskftd'),
	'7003' => array('name' => '投诉配送服务态度', 'py' => 'tspsfwtd'),
	'7004' => array('name' => '投诉配送速度', 'py' => 'tspssd'),
	'7005' => array('name' => '用户建议', 'py' => 'yhjy'),
	'7006' => array('name' => '用户表扬', 'py' => 'yhby'),
	'7007' => array('name' => '诈骗电话', 'py' => 'zpdh'),
	'7008' => array('name' => '疑似信息泄漏', 'py' => 'ysxxxl'),
	'7009' => array('name' => '无效咨询', 'py' => 'wxzx'),
	'7010' => array('name' => '系统问题', 'py' => 'xtwt'),
	'7011' => array('name' => '订单无故被取消', 'py' => 'ddwgbqx'),
	'7012' => array('name' => '活动投诉', 'py' => 'hdts'),
	'7013' => array('name' => '其他', 'py' => 'qt'),
	'8' => array('name' => '差评导入', 'py' => 'cpdr'),
	'8001' => array('name' => '商品质量', 'py' => 'spzl'),
	'8002' => array('name' => '配件质量', 'py' => 'pjzl'),
	'8003' => array('name' => '物流配送', 'py' => 'wlps'),
	'8004' => array('name' => '性价比问题', 'py' => 'xjbwt'),
	'8005' => array('name' => '商品降价', 'py' => 'spjj'),
	'8006' => array('name' => '商品描述错误', 'py' => 'spmscw'),
	'8007' => array('name' => '疑似二手', 'py' => 'yses'),
	'8008' => array('name' => '疑似假货', 'py' => 'ysjh'),
	'8009' => array('name' => '发票问题', 'py' => 'fpwt'),
	'8010' => array('name' => '综合因素', 'py' => 'zhys'),
	'8011' => array('name' => '疑似广告', 'py' => 'ssgg'),
	'8012' => array('name' => '未指明原因', 'py' => 'wzmyy')
);

